Revit 2024 API
BalusterPattern.PatternAngle Property
 The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public double PatternAngle { get; set; }
Visual Basic
Public Property PatternAngle As Double
	Get
	Set
Visual C++
public:
property double PatternAngle {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for patternAngle is not finite
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace